Repository: meirf/ruiqi.thundersnow.yext.com
Catalog: messages/*.po
Languages: es_mx, it

source: Customer Service:
es_mx: Servicio al cliente:

source: Search
es_mx: Buscar

source: Get Directions
es_mx: Obtener Direcciones
it: Calcola il percorso

source: View Details
es_mx: Ver Detalles
it: Maggiori dettagli

source: Women's Shoes
es_mx: Zapatos Dama
it: Scarpe donna

source: Women's Leather Goods
es_mx: Accesorios de piel Dama
it: Piccola pelletteria donna

source: Women's Rtw
es_mx: Dama Ready To Wear
it: Donna RTW

source: Women's Silk And Accessories
es_mx: Mascadas y Bijoux
it: Seta e accessori donna

source: Men's Shoes
es_mx: Zapatos Caballero
it: Scarpe uomo

source: Men's Leather Goods
es_mx: Accesorios de piel Caballero
it: Piccola pelletteria uomo

source: Men's Ties And Accessories
es_mx: Corbatas y Bijoux Caballero
it: Cravatte e accessori uomo

source: Men's Rtw
es_mx: Caballero Ready To Wear
it: Uomo RTW

source: Sunglasses
es_mx: Lentes de sol
it: Occhiali da sole

source: Fragrance
es_mx: Fragancias
it: Profumi

source: Watches
es_mx: Relojes
it: Orologi

source: Fine Jewelry
es_mx: Alta Joyería
it: Gioielli in oro

source: Home
es_mx: Inicio

source: Locations
es_mx: Ubicaciones
it: Negozi

source: Read more
es_mx: Leer más
it: Espandi

source: Read less
es_mx: Leer menos
it: Riduci

source: Visit Site
es_mx: Visitar el Sitio
it: Visita il sito

source: Directions
es_mx: Direcciones

source: Store Hours:
es_mx: Horario de Tienda:
it: Orari del negozio:

source: Open 24 hours
es_mx: Abierto las 24 horas
it: Aperto 24 ore

source: Closed
es_mx: Cerrado
it: Chiuso

source: Open until midnight
es_mx: Abierto hasta media noche
it: Aperto fino alla mezzanotte

source: Open until
es_mx: Abierto hasta
it: Aperto fino a

source: Closed at
es_mx: Cerrado en
it: Chiude alle

source: Open Today
es_mx: Abierto Hoy
it: Aperto oggi

source: Monday
es_mx: Lunes
it: Lunedì

source: Tuesday
es_mx: Martes
it: Martedì

source: Wednesday
es_mx: Miércoles
it: Mercoledì

source: Thursday
es_mx: Jueves
it: Giovedì

source: Friday
es_mx: Viernes
it: Venerdì

source: Saturday
es_mx: Sábado
it: Sabato

source: Sunday
es_mx: Domingo
it: Domenica

source: Closed Today
es_mx: Cerrado Hoy
it: Chiuso oggi

source: Share
es_mx: Compartir
it: Condividi

source: Follow
es_mx: Síguenos
it: Seguici

source: Nearby Locations
es_mx: Boutiques más cercanas
it: Boutiques più vicine

source: Search by City, State, Zip...
es_mx: Buscar por Ciudad, Estado o Código postal

source: {BRAND_NAME} Boutiques in {META_GEOMODIFIER} | Shoes, Handbags, Belts, Accessories
es_mx: {BRAND_NAME} Boutiques en {META_GEOMODIFIER} | Zapatos, Bolsos, Cinturones, Accesorios

source: Browse all {BRAND_NAME} boutiques in {META_GEOMODIFIER} to explore the new collections.
es_mx: Eche un vistazo a todas las boutiques {BRAND_NAME} en {META_GEOMODIFIER} y explore las nuevas colecciones.

source: Shop women's and men's shoes, ties and belts: perfection made in Italy.
es_mx: Compre zapatos de Dama y Caballero, corbatas y cinturones: La perfección creada en Italia.
it: Potrai acquistare scarpe da donna e da uomo, cravatte e cinture Made in Italy.

source: All {BRAND_NAME} Boutiques | Shoes, Handbags, Belts, Accessories
es_mx: Todo {BRAND_NAME} Boutiques | Zapatos, Bolsos, Cinturones, Accesorios
it: Tutte {BRAND_NAME} Boutiques | Scarpe, Borse, Cinture e Accessori

source: Browse all {BRAND_NAME} boutiques to explore the new collections.
es_mx: Eche un vistazo a todas las boutiques {BRAND_NAME} y explore las nuevas colecciones.

source: {BRAND_NAME} in {ADDRESS_1} {CITY}, {STATE} | Shoes, Handbags, Belts, Accessories
es_mx: {BRAND_NAME} Boutiques en {ADDRESS_1} {CITY}, {STATE} | Zapatos, Bolsos, Cinturones, Accesorios
it: {BRAND_NAME} in {ADDRESS_1} {CITY}, {STATE} | Scarpe, Borse, Cinture e Accessori

source: Visit your local {BRAND_NAME} at {ADDRESS_1} in {CITY}, {STATE} to explore the new collections.
es_mx: Visite su boutique local {BRAND_NAME} en {ADDRESS_1} en {STATE}, {CITY} para explorar las nuevas colecciones.
it: Visita la Nostra Boutique presso {ADDRESS_1} a {CITY}, {STATE} per esplorare la nuova collezione.

source: About
es_mx: Sobre
it: Informazioni su

source: Customer Care
es_mx: Servicio al cliente

source: At This Location
es_mx: En esta Ubicación
it: In questo posto

source: Events at
es_mx: Eventos en
it: Eventi a

source: Email Us
es_mx: Mándenos un correo electrónico
it: Scrivi

source: Opening Hours
es_mx: Horas de Operación
it: Orari di apertura

source: Nearby Boutiques
es_mx: Boutiques más cercanas
it: Boutique più vicine

source: Search by City, State or Zip Code
es_mx: Buscar por Ciudad, Estado o Código postal
it: Cerca utilizzando la Città, lo Stato o il Codice Postale

source: Find the nearest {BRAND_NAME} boutique near you | Shoes, Handbags, Belts, Accessories
es_mx: Encuentre la Boutique {BRAND_NAME} más cercana a usted | Zapatos, Bolsos, Cinturones, Accesorios
it: Cerca la boutique {BRAND_NAME} più vicina a te | Scarpe, borse, cinture e accessori.

source: Boutique Locator
es_mx: Localizador de Boutiques
it: Store Locator

source: View All Boutiques
es_mx: Ver todas las Boutiques
it: Tutte le Boutiques

source: 1 store near
es_mx: 1 tienda cercana
it: Negozio vicino

source: List
es_mx: Lista
it: Lista

source: Map
es_mx: Mapa
it: Mappa

source: mi
es_mx: Millas

source: Open
es_mx: Abierto

source: Europe
it: Europa

source: Middle East
it: Medio Oriente

source: Kids
it: Bambino
